# Pandas Student Notebook — Foundations (Easy+)  
## Dataset: Kaggle “Students Performance in Exams”

### Goal of this notebook
This notebook is **slightly harder** than the easy version:
- still one table (no joins)
- introduces: `pd.cut`, `groupby().agg`, `sort_values`, basic string cleaning
- introduces: simple “data quality” checks

You should still avoid loops. Use vectorized Pandas operations.

## 0. Setup

Load `StudentsPerformance.csv` into a DataFrame called `df`.

Write as a comment:
- What does one row represent? (grain)

## 1. Quick audit

1) Show missing values per column.  
2) Check if any score is outside the range 0–100 (count violations).

Hint: use comparisons + `any()` / `sum()`.

Write as a comment:
- Why are “score outside 0–100” rows a data quality issue?

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

Empty DataFrame
Columns: [gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []

## 2. Feature engineering: average + strong/weak flags

Create:
- `avg_score` = mean of the three scores
- `strong_math` = True if math score is at least 80
- `weak_reading` = True if reading score is less than 50

Show the first 5 rows of these new columns.

   avg_score  strong_math  weak_reading
0  72.666667        False         False
1  82.333333        False         False
2  92.666667         True         False
3  49.333333        False         False
4  76.333333        False         False

## 3. Groupby + multiple aggregations

Create a table grouped by `gender` with:
- number of students
- mean math score
- mean reading score
- mean writing score

Sort by mean `reading score` from high to low.

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avg_score,strong_math,weak_reading
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667,False,False
1,female,group C,some college,standard,completed,69,90,88,82.333333,False,False
2,female,group B,master's degree,standard,none,90,95,93,92.666667,True,False
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333,False,False
4,male,group C,some college,standard,none,76,78,75,76.333333,False,False

,number_of_students,mean_math_score,mean_reading_score,mean_writing_score
gender,,,,
female,518,63.633205,72.608108,72.467181
male,482,68.728216,65.473029,63.311203

## 4. Basic string cleaning

Look at the `lunch` column.

1) Show `value_counts()` for `lunch`.  
2) Create a new column called `lunch_clean` by making everything titlecase, and changing '/' to ' or '
3) Show `value_counts()` again for `lunch_clean`.

lunch
standard        645
free/reduced    355
Name: count, dtype: int64

lunch_clean
Standard           645
Free or Reduced    355
Name: count, dtype: int64